Revit 2024 API
ForgeTypeId Constructor
 Constructs a ForgeTypeId holding an empty schema identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ForgeTypeId()
Visual Basic
Public Sub New
Visual C++
public:
ForgeTypeId()
See Also
ForgeTypeId Class
ForgeTypeId Overload
Autodesk.Revit.DB Namespace